test/multiphaseEuler/populationBalance/uniformGrowth/system/fvConstraints
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvConstraints;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//zeroDimensionalFixedPressure1
//{
//    type            zeroDimensionalFixedPressure;
//
//    p               p_rgh;
//
//    pressure        1e5;
//}

// ************************************************************************* //
